TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
  if (pb) {
    if (err != ERR_OK) {
      ASYNC_TCP_CONSOLE_E("err %s", c->errorToString(err));
      pbuf_free(pb);
      err = c->_lwip_abort(pcb);
      e->event = LWIP_TCP_ERROR;
    }

    // ASYNC_TCP_CONSOLE_I("pb = %u tot_len = %u len = %u ref = %u", pb, pb->tot_len, pb->len, pb->ref);
    // Let async thread handle
    // tcp_recved(pcb, pb->tot_len);
    // pbuf_free(pb);
  } else {
    ASYNC_TCP_CONSOLE_I("Client %u closed", c);
    e->event = LWIP_TCP_FIN;
    err = c->_lwip_close(pcb);
  }

  queue_mutex_guard guard;
  if (err == ERR_ABRT) {
    ASYNC_TCP_CONSOLE_E("Return %s", c->errorToString(err));
    _prepend_async_event(e);
  } else {
    _send_async_event(e);
  }
  return err;
}

err_t AsyncTCP_detail::tcp_sent(void *arg, struct tcp_pcb *pcb, uint16_t len) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  bool slot = _is_client_slot_valid(c);
  lwip_tcp_event_packet_t *e = (slot && c->_pcb == pcb) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_SENT, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    if (slot) {
      c->_lwip_abort(pcb);
      c->_error(ERR_MEM);
    } else {
      tcp_abort(pcb);
    }
    return ERR_ABRT;  // Tell lwIP we're killing it immediately
  }
  e->sent.pcb = pcb;
  e->sent.len = len;

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

void AsyncTCP_detail::tcp_error(void *arg, err_t err) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  ASYNC_TCP_CONSOLE_E("Client %u Connection aborted or reset, err = %s", c, c->errorToString(err));
  if (_is_client_slot_valid(c)) {
    ASYNC_TCP_CONSOLE_E("Removed c %u", c);
    _remove_events_for_client(c);
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);

    // enqueue event to be processed in the async task for the user callback
    lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_ERROR, c};
    if (!e) {
      ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
      // Forcing error here may not be safe if calling is outside Async thread, but there's no other way.
      c->_error(err);
      return;
    }

    e->error.err = err;
    queue_mutex_guard guard;
    _send_async_event(e);
  }
}

void AsyncTCP_detail::_tcp_dns_found(const char *name, const ip_addr_t *ipaddr, void *arg) {
  ASYNC_TCP_CONSOLE_I("+DNS: name=%s ipaddr=0x%08x arg=%x\n", name, ipaddr, arg);
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);

  lwip_tcp_event_packet_t *e = (c) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_DNS, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    return;
  }

  e->dns.name = name;
  if (ipaddr) {
    memcpy(&e->dns.addr, ipaddr, sizeof(ip_addr_t));
  } else {
    ASYNC_TCP_CONSOLE_E("Failed to found DNS address for %s", name);
    e->dns.addr.type = IPADDR_TYPE_ANY + 1;  // not IPv4 or IPv6 or IPv4+IPv6, @ref lwip_ip_addr_type
  }

  queue_mutex_guard guard;
  _send_async_event(e);
}

/*
 * TCP/IP API Calls
 * */

#include "lwip/priv/tcpip_priv.h"
typedef struct {
  struct tcpip_api_call_data call;
  AsyncClient *client;
  tcp_pcb *pcb;
  s8_t client_slot;
  err_t err;
  union {
    struct {
      const char *data;
      size_t size;
      uint8_t apiflags;
    } write;
    size_t received;
    struct {
      ip_addr_t *addr;
      tcp_connected_fn cb;
      void *arg;
      uint16_t port;
    } connect;
    struct {
      ip_addr_t *addr;
      const char *name;
      dns_found_callback cb;
      void *arg;
    } dns_found;
    struct {
      tcp_close_callback cb;
      void *arg;
    } close;
    struct {
      tcp_abort_callback cb;
      void *arg;
    } abort;
    struct {
      tcp_callback cb;
      void *arg;
    } callback;
    struct {
      ip_addr_t *addr;
      u8_t type;
    } new_ip;
    struct {
      ip_addr_t *addr;
      uint16_t port;
    } bind;
    uint8_t backlog;
  };
} tcp_api_call_t;

static err_t _tcp_output_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->client_slot, msg->pcb)) {
    msg->err = tcp_output(msg->pcb);
  }
  return msg->err;
}

static esp_err_t _tcp_output(tcp_pcb *pcb, s8_t client_slot) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.client_slot = client_slot;
  tcpip_api_call(_tcp_output_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_write_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->client_slot, msg->pcb)) {
    msg->err = tcp_write(msg->pcb, msg->write.data, msg->write.size, msg->write.apiflags);
  }
  return msg->err;
}

static esp_err_t _tcp_write(tcp_pcb *pcb, s8_t client_slot, const char *data, size_t size, uint8_t apiflags) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.client_slot = client_slot;
  msg.write.data = data;
  msg.write.size = size;
  msg.write.apiflags = apiflags;
  tcpip_api_call(_tcp_write_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_recved_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->client_slot, msg->pcb)) {
    msg->err = ERR_OK;
    tcp_recved(msg->pcb, msg->received);
  }
  return msg->err;
}

static esp_err_t _tcp_recved(tcp_pcb *pcb, int8_t client_slot, size_t len) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.client_slot = client_slot;
  msg.received = len;
  tcpip_api_call(_tcp_recved_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

#if (0)
static err_t _tcp_close_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->client_slot, msg->pcb)) {
    _reset_tcp_callbacks(msg->pcb, nullptr);// It has to be called before tcp_close();
    msg->err = tcp_close(msg->pcb);
    if (msg->err != ERR_OK) {
      tcp_abort(msg->pcb);
      msg->err = ERR_ABRT;
    }
    if (msg->close.cb) {
      msg->close.cb(msg->close.arg, msg->err);
    }
  }
  return msg->err;
}

static esp_err_t _tcp_close(tcp_pcb *pcb, s8_t client_slot, tcp_close_callback cb, void *arg) {
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.client_slot = client_slot;
  msg.close.cb = cb;
  msg.close.arg = arg;
  tcpip_api_call(_tcp_close_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}
#endif

#if (0)
static err_t _tcp_abort_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->client_slot, msg->pcb)) {
    _reset_tcp_callbacks(msg->pcb, nullptr);// It has to be called before tcp_abort();
    tcp_abort(msg->pcb);
    msg->err = ERR_ABRT;
    if (msg->abort.cb) {
      msg->abort.cb(msg->abort.arg);
    }
  }
  return msg->err;
}

