TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
  tcp_pcb *pcb;
#if LWIP_IPV4 && LWIP_IPV6
  pcb = _tcp_new_ip_type(addr.type);
#else
  pcb = _tcp_new_ip_type(IPADDR_TYPE_V4);
#endif
  if (!pcb) {
    ASYNC_TCP_CONSOLE_E("pcb == NULL");
    return false;
  }

  esp_err_t err = _tcp_connect(pcb, _slot, &addr, port, AsyncTCP_detail::tcp_connected, this);
  bool result = (err == ESP_OK);
  if (!result) {
    ASYNC_TCP_CONSOLE_E("tcp_connect failed: %d", err);
  }
  return result;
}

#ifdef ARDUINO
bool AsyncClient::connect(const IPAddress &ip, uint16_t port) {
  ip_addr_t addr;
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  // if both IPv4 and IPv6 are enabled, ip_addr_t has a union field and the address type
  addr.u_addr.ip4.addr = ip;
  addr.type = IPADDR_TYPE_V4;
#else
  addr.addr = ip;
#endif
#else
  ip.to_ip_addr_t(&addr);
#endif
  ASYNC_TCP_CONSOLE_I("%u IP %s, port: %u", this, ip.toString().c_str(), port);
  return connect(addr, port);
}
#endif

#if LWIP_IPV6 && ESP_IDF_VERSION_MAJOR < 5
bool AsyncClient::connect(const IPv6Address &ip, uint16_t port) {
  auto ipaddr = static_cast<const uint32_t *>(ip);
  ip_addr_t addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);

  return connect(addr, port);
}
#endif

bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  ASYNC_TCP_CONSOLE_I("%u host %s, port: %u", this, host, port);

  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE_E("failed to start task");
    return false;
  }

  _connect_port = port;
  err_t err = _dns_gethostbyname(host, &addr, AsyncTCP_detail::_tcp_dns_found, this);

  if (err == ERR_OK) {
    ASYNC_TCP_CONSOLE_I("IP: %s\n", ipaddr_ntoa(&addr));
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV6
    if (addr.type == IPADDR_TYPE_V6) {
      return connect(IPv6Address(addr.u_addr.ip6.addr), port);
    }
    return connect(IPAddress(addr.u_addr.ip4.addr), port);
#else
    return connect(IPAddress(addr.addr), port);
#endif
#else
    return connect(addr, port);
#endif
  } else if (err == ERR_INPROGRESS) {
    ASYNC_TCP_CONSOLE_I("DNS query sent, waiting for callback...\n");
    return true;
  }
  ASYNC_TCP_CONSOLE_E("error: %d", err);
  return false;
}

/**
 * close() --> onDisconnect() --> ~AsyncClient()
*/
void AsyncClient::close(bool now) {
  if (_is_pcb_slot_valid(_slot, _pcb)) {
    ASYNC_TCP_CONSOLE_I("c %u call close(%u)", this, now);
  } else {
    ASYNC_TCP_CONSOLE_I("c %u already closed", this);
    return;
  }
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_DISCONNECT, this};
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    _remove_events_for_client(this);
    _close(); // client shall be closed directly in lwIP thread
    // Forcing disconnection here may not be safe if calling is outside Async thread, but there's no other way.
    _disconnect(ERR_CLSD);
    return;
  }

  if (now) {
    _remove_events_for_client(this);
    _close(); // client shall be closed directly in lwIP thread 
  } // else client shall be called to close in Async thread

  e->disconnect.err = now ? ERR_CLSD : ERR_ISCONN;
  queue_mutex_guard guard;
  if (now) {
    _prepend_async_event(e);
  } else {
    _send_async_event(e);
  }
}

/**
 * abort() -->onDisconnect() --> ~AsyncClient()
*/
err_t AsyncClient::abort() {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  if (_is_pcb_slot_valid(_slot, _pcb)) {
    ASYNC_TCP_CONSOLE_I("c %u call abort()", this);
    // client is not closed, so we can abort it.
  } else {
    ASYNC_TCP_CONSOLE_I("c %u already closed", this);
    // client is already closed, no need to do anything.
    return ERR_ABRT;
  }
  _remove_events_for_client(this);
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_DISCONNECT, this};
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    _abort(); // client shall be abort directly in lwIP thread
    // Forcing disconnection here may not be safe if calling is outside Async thread, but there's no other way.
    _disconnect(ERR_CLSD);
    return ERR_ABRT;
  }
  _abort(); // client shall be abort directly in lwIP thread
  e->disconnect.err = ERR_CLSD;
  queue_mutex_guard guard;
  _prepend_async_event(e);
  return ERR_ABRT;
}

size_t AsyncClient::space() {
  _space = 0;
  if (_pcb && (_pcb->state == ESTABLISHED)) {
    _lwip_callback([](void *arg)->err_t {
      AsyncClient *c = (AsyncClient *)arg;
      err_t err = ERR_CONN;
      if (_is_pcb_slot_valid(c->_slot, c->_pcb)) {
        c->_space = tcp_sndbuf(c->_pcb);
        err = ERR_OK;
      } else {
        ASYNC_TCP_CONSOLE_E("c %u already closed", c);
      }
      return err;
    }, this);
  }
  return _space;
}

size_t AsyncClient::add(const char *data, size_t size, uint8_t apiflags) {
  if (!_pcb || size == 0 || data == NULL) {
    ASYNC_TCP_CONSOLE_E("c %u pcb null", this);
    return 0;
  }
  size_t room = space();
  if (!room) {
    ASYNC_TCP_CONSOLE_E("c %u space 0", this);
    return 0;
  }
  size_t will_send = (room < size) ? room : size;
  err_t err = ERR_OK;
  err = _tcp_write(_pcb, _slot, data, will_send, apiflags);
  if (err != ERR_OK) {
    ASYNC_TCP_CONSOLE_E("c %u Err %d", this, err);
    return 0;
  }
  return will_send;
}

bool AsyncClient::send() {
  auto backup = _tx_last_packet;
  _tx_last_packet = millis();
  err_t err = _tcp_output(_pcb, _slot);
  if (err == ERR_OK) {
    return true;
  } else {
    ASYNC_TCP_CONSOLE_E("c %u Err %d", this, err);
  }
  _tx_last_packet = backup;
  return false;
}

size_t AsyncClient::ack(size_t len) {
  if (len > _rx_ack_len) {
    len = _rx_ack_len;
  }
  _rx_ack_len -= len;
  return len;
}

void AsyncClient::ackPacket(struct pbuf *pb) {
  if (!pb) {
    return;
  }
  _tcp_recved(_pcb, _slot, pb->len);
  pbuf_free(pb);
}

/*
 * Main Private Methods
 * */

err_t AsyncClient::_close() {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  err_t err = ERR_OK;
#if (0)
  err = _tcp_close(_pcb, _slot, [](void *arg, err_t err) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    if (err == ERR_ABRT) {
      _remove_events_for_client(c);
    }
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
#else
  err = _lwip_callback([](void *arg)->err_t {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    err_t err = ERR_CONN;
    if (_is_pcb_slot_valid(c->_slot, c->_pcb)) {
      _reset_tcp_callbacks(c->_pcb, c); // It has to be called before tcp_close();
      err = tcp_close(c->_pcb);
      if (err != ERR_OK) {
        _remove_events_for_client(c);
        tcp_abort(c->_pcb);
        err = ERR_ABRT;
      }
      c->_pcb = nullptr;
      c->_slot = INVALID_CLIENT_SLOT;
    }
    _unregister_client_slot(c);
    return err;
  }, this);
#endif
  return err;
}

err_t AsyncClient::_abort() {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  err_t err = ERR_OK;
#if (0)
  err = _tcp_abort(_pcb, _slot, [](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    _remove_events_for_client(c);
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
#else
  err = _lwip_callback([](void *arg)->err_t {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    err_t err = ERR_CONN;
    _remove_events_for_client(c);
    if (_is_pcb_slot_valid(c->_slot, c->_pcb)) {
      _reset_tcp_callbacks(c->_pcb, c); // It has to be called before tcp_abort();
      tcp_abort(c->_pcb);
      err = ERR_ABRT;
      c->_pcb = nullptr;
      c->_slot = INVALID_CLIENT_SLOT;
    }
    _unregister_client_slot(c);
    return err;
  }, this);
#endif
  return err;
}

