TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
void AsyncClient::resetCallback() {
  _connect_cb = nullptr;
  _discard_cb = nullptr;
  _sent_cb = nullptr;
  _error_cb = nullptr;
  _recv_cb = nullptr;
  _pb_cb = nullptr;
  _timeout_cb = nullptr;
  _poll_cb = nullptr;
}

bool AsyncClient::valid() {
  return !!_pcb;
}

/*
 * Private Callbacks
 * */
err_t AsyncClient::_connected(tcp_pcb *pcb) {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  if (_pcb) {
    _rx_last_packet = millis();
  }
  _tx_last_packet = 0;
  _rx_last_ack = 0;
  if (_connect_cb) {
    _connect_cb(_connect_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_disconnect(err_t err) {
  ASYNC_TCP_CONSOLE_I("c %u err = %d", this, err);
  if (ERR_ISCONN == err) {
    _close(); // close client in lwIP thread 
  }

  if (_discard_cb) {
    if (_server) {
      _discard_cb(_discard_cb_arg, nullptr);
      _server->_handleDisconnect(this); // notify server about client disconnect
    } else {
      _discard_cb(_discard_cb_arg, this); // notify user about client disconnect
    }
  } else if (_server) {
    _server->_handleDisconnect(this); // notify server about client disconnect
  } else {
    ASYNC_TCP_CONSOLE_I("No discard callback, c %u", this);
  }
}

void AsyncClient::_error(err_t err) {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  if (_error_cb) {
    _error_cb(_error_cb_arg, this, err);
  }
  _disconnect(ERR_CLSD);
}

// Must be called In LwIP Thread
err_t AsyncClient::_lwip_abort(tcp_pcb *pcb) {
  err_t err = ERR_OK;
  _remove_events_for_client(this);
  if (pcb) {
    _reset_tcp_callbacks(pcb, this);
    tcp_abort(pcb);
    err = ERR_ABRT;
  }
  _pcb = nullptr;
  _slot = INVALID_CLIENT_SLOT;
  _unregister_client_slot(this);
  return err;
}

// Must be called In LwIP Thread
err_t AsyncClient::_lwip_close(tcp_pcb *pcb) {
  err_t err = ERR_OK;
  if (pcb) {
    _reset_tcp_callbacks(pcb, this);
    if (tcp_close(pcb) != ERR_OK) {
      _remove_events_for_client(this);
      tcp_abort(pcb);
      err = ERR_ABRT;
    }
  }
  _pcb = nullptr;
  _slot = INVALID_CLIENT_SLOT;
  _unregister_client_slot(this);
  return err;
}

// In Async Thread
err_t AsyncClient::_fin(tcp_pcb *pcb, err_t err) {
  ASYNC_TCP_CONSOLE_I("c %u", this);
  _disconnect(ERR_CLSD);
  return ERR_OK;
}

err_t AsyncClient::_sent(tcp_pcb *pcb, uint16_t len) {
  _rx_last_ack = _rx_last_packet = millis();
  // ASYNC_TCP_CONSOLE_I("_rx_last_packet %u", _rx_last_packet);
  if (_sent_cb) {
    _sent_cb(_sent_cb_arg, this, len, (_rx_last_packet - _tx_last_packet));
  }
  return ERR_OK;
}

err_t AsyncClient::_recv(tcp_pcb *pcb, pbuf *pb, err_t err) {
  while (pb != NULL) {
    _rx_last_packet = millis();
    ASYNC_TCP_CONSOLE_I("C %u len = %u/%u", this, pb->len, pb->tot_len);
    // we should not ack before we assimilate the data
    // _ack_pcb = true; // It is always true with whenever new client established. It should not force true here due to the ackLater() will not be valid anymore
    pbuf *b = pb;
    pb = b->next;
    b->next = NULL;
    if (_pb_cb) {
      _pb_cb(_pb_cb_arg, this, b);
    } else {
      if (_recv_cb) {
        _recv_cb(_recv_cb_arg, this, b->payload, b->len);
      }
      if (!_ack_pcb) {
        _rx_ack_len += b->len;
      } else if (_pcb) {
        _tcp_recved(_pcb, _slot, b->len);
      }
      pbuf_free(b);
    }
  }
  return ERR_OK;
}

err_t AsyncClient::_poll(tcp_pcb *pcb) {
  if (!_pcb) {
    ASYNC_TCP_CONSOLE_E("pcb is NULL");
    return ERR_OK;
  }
  if (pcb != _pcb) {
    ASYNC_TCP_CONSOLE_E("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }

  uint32_t now = millis();
  ASYNC_TCP_CONSOLE_I("Client %u pcb %u, _rx_timeout %u, now %u, _rx_last_packet %u", this, pcb, _rx_timeout, now, _rx_last_packet);

  // ACK Timeout
  if (_ack_timeout) {
    const uint32_t one_day = 86400000;
    bool last_tx_is_after_last_ack = (_rx_last_ack - _tx_last_packet + one_day) < one_day;
    if (last_tx_is_after_last_ack && (now - _tx_last_packet) >= _ack_timeout) {
      ASYNC_TCP_CONSOLE_E("ack timeout %d", pcb->state);
      if (_timeout_cb) {
        _timeout_cb(_timeout_cb_arg, this, (now - _tx_last_packet));
      }
      return ERR_OK;
    }
  }
  // RX Timeout
  if (_rx_timeout && (now - _rx_last_packet) >= (_rx_timeout * 1000)) {
    ASYNC_TCP_CONSOLE_E("Client %u: rx timeout with pcb state %d", this, pcb->state);
    _abort(); // client shall be aborted directly in lwIP thread
    _remove_events_for_client(this);
    _error(ERR_TIMEOUT);
    return ERR_OK;
  }
  // Everything is fine
  if (_poll_cb) {
    _poll_cb(_poll_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_dns_found(ip_addr_t *ipaddr) {
  if (ipaddr->type == IPADDR_TYPE_ANY || ipaddr->type == IPADDR_TYPE_V4 || ipaddr->type == IPADDR_TYPE_V6) {
    ASYNC_TCP_CONSOLE_I("IP: %s\n", ipaddr_ntoa(ipaddr));
    connect(*ipaddr, _connect_port);
  } else {
    if (_error_cb) {
      _error_cb(_error_cb_arg, this, -55);
    }
    _disconnect(ERR_CLSD);
  }
}

/*
 * Public Helper Methods
 * */

bool AsyncClient::free() {
  if (!_pcb) {
    return true;
  }
  if (_pcb->state == CLOSED || _pcb->state > ESTABLISHED) {
    return true;
  }
  return false;
}

size_t AsyncClient::write(const char *data, size_t size, uint8_t apiflags) {
  size_t will_send = add(data, size, apiflags);
  if (!will_send || !send()) {
    return 0;
  }
  return will_send;
}

void AsyncClient::setRxTimeout(uint32_t timeout) {
  _rx_timeout = timeout;
}

uint32_t AsyncClient::getRxTimeout() const {
  return _rx_timeout;
}

uint32_t AsyncClient::getAckTimeout() const {
  return _ack_timeout;
}

void AsyncClient::setAckTimeout(uint32_t timeout) {
  _ack_timeout = timeout;
}

void AsyncClient::setNoDelay(bool nodelay) const {
  if (!_pcb) {
    return;
  }
  if (nodelay) {
    tcp_nagle_disable(_pcb);
  } else {
    tcp_nagle_enable(_pcb);
  }
}

bool AsyncClient::getNoDelay() {
  if (!_pcb) {
    return false;
  }
  return tcp_nagle_disabled(_pcb);
}

void AsyncClient::setKeepAlive(uint32_t ms, uint8_t cnt) {
  if (ms != 0) {
    _pcb->so_options |= SOF_KEEPALIVE;  // Turn on TCP Keepalive for the given pcb
    // Set the time between keepalive messages in milli-seconds
    _pcb->keep_idle = ms;
    _pcb->keep_intvl = ms;
    _pcb->keep_cnt = cnt;  // The number of unanswered probes required to force closure of the socket
  } else {
    _pcb->so_options &= ~SOF_KEEPALIVE;  // Turn off TCP Keepalive for the given pcb
  }
}

uint16_t AsyncClient::getMss() const {
  if (!_pcb) {
    return 0;
  }
  return tcp_mss(_pcb);
}

uint32_t AsyncClient::getRemoteAddress() const {
  if (!_pcb) {
    return 0;
  }
#if LWIP_IPV4 && LWIP_IPV6
  return _pcb->remote_ip.u_addr.ip4.addr;
#else
  return _pcb->remote_ip.addr;
#endif
}

