TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
void AsyncServer::onClient(AcConnectHandler cb, void *arg) {
  _listen_connect_cb = cb;
  _connect_cb_arg = arg;
}

bool AsyncServer::begin(uint16_t port) {
  if (_listen_pcb) {
    return true;
  }

  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE_E("failed to start task");
    return false;
  }

  if (port != 0) {
    _port = port;
  }

  // Safely to run in the LwIP thread
  err_t err = _lwip_callback([](void *arg)->err_t {
    AsyncServer *server = (AsyncServer *)arg;
    err_t err;
#if LWIP_IPV4 && LWIP_IPV6
    server->_listen_pcb = tcp_new_ip_type(server->_addr.type);
#else
    _pcb = _tcp_new_ip_type(IPADDR_TYPE_ANY);
#endif
    if (!server->_listen_pcb) {
      ASYNC_TCP_CONSOLE_E("_pcb == NULL");
      return ERR_VAL;
    }

    err = tcp_bind(server->_listen_pcb, &server->_addr, server->_port);

    if (err != ERR_OK) {
      ASYNC_TCP_CONSOLE_E("bind error: %d", err);
      tcp_abort(server->_listen_pcb); // forcibly free unbound PCB
      server->_listen_pcb = NULL;
      return ERR_ABRT;
    }

    constexpr uint8_t backlog = CONFIG_LWIP_MAX_LISTENING_TCP;
    server->_listen_pcb = tcp_listen_with_backlog(server->_listen_pcb, backlog);
    if (!server->_listen_pcb) {
      ASYNC_TCP_CONSOLE_E("listen_pcb == NULL");
      return ERR_VAL;
    }
    tcp_arg(server->_listen_pcb, (void *)server);
    tcp_accept(server->_listen_pcb, &AsyncTCP_detail::tcp_accept);
    return ERR_OK;
  }, this);

  if (err != ERR_OK) {
    ASYNC_TCP_CONSOLE_E("Server %u Init Failed", this);
  } else {
    ASYNC_TCP_CONSOLE_I("Server %u Init succeed", this);
  }
  return (err == ERR_OK);
}

void AsyncServer::end() {
  ASYNC_TCP_CONSOLE_I("Server %u End", this);
  _lwip_callback([](void *arg)->err_t {
    AsyncServer *s = (AsyncServer *)arg;
    s->_lwip_end();
    return ERR_OK;
  }, this);

  if (_wait_events) {
    EventBits_t bits = xEventGroupWaitBits(
      _disconnect_events, _wait_events,
      pdFALSE, // unclear bits on exit
      pdTRUE,  // all bits
      pdMS_TO_TICKS(5000) // wait for 1s
    );
    ASYNC_TCP_CONSOLE_I("Server %u closed all clients, bits = %08X", this, bits);
  }
}

// Must be called In LwIP Thread
void AsyncServer::_lwip_end() {
  if (_listen_pcb) {
    tcp_arg(_listen_pcb, NULL);
    tcp_accept(_listen_pcb, NULL);
    if (tcp_close(_listen_pcb) != ERR_OK) {
      tcp_abort(_listen_pcb);
    }
    _listen_pcb = NULL;
  }

  if (!_disconnect_events) {
    _disconnect_events = xEventGroupCreate();
  }
  _wait_events = 0;
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    AsyncClient *c = _clients[i];
    if (c && c->_pcb && (c->_server == this)) {
      c->_id_disconnect = i;
      ASYNC_TCP_CONSOLE_I("Client %u disconnect id = %d", c, c->_id_disconnect);
      bitSet(_wait_events, i);
      xEventGroupClearBits(_disconnect_events, 1U << i);
      err_t err = c->_lwip_close(c->_pcb); // close immediately in LwIP thread
      lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_FIN, c};
      if (!e) {
        ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
        c->_error(ERR_MEM);
        continue;
      }
      e->sent.pcb = c->_pcb;
      e->recv.err = err;

      queue_mutex_guard guard;
      if (err == ERR_ABRT) {
        _prepend_async_event(e);
      } else {
        _send_async_event(e);
      }
    }
  }
}

err_t AsyncServer::_accepted(AsyncClient *client) {
  if (_listen_connect_cb) {
    _listen_connect_cb(_connect_cb_arg, client);
  }
  return ERR_OK;
}

void AsyncServer::_handleDisconnect(AsyncClient *client) {
  if (client) {
    if (client->_id_disconnect != INVALID_CLIENT_EVENT_ID) {
      ASYNC_TCP_CONSOLE_I("s %u handle disconnect for c %u id = %u", this, client, client->_id_disconnect);
      xEventGroupSetBits(_disconnect_events, 1U << client->_id_disconnect);
    }
#if (ASYNC_TCP_DELETION_HANDLE == 1)
    delete client;
#endif
  }
}

void AsyncServer::setNoDelay(bool nodelay) {
  _noDelay = nodelay;
}

bool AsyncServer::getNoDelay() const {
  return _noDelay;
}

uint8_t AsyncServer::status() const {
  if (!_listen_pcb) {
    return 0;
  }
  return _listen_pcb->state;
}
